
{
  "title":"Readings",
  "content":"There is no textbook required for the course. Lecture notes are available for the current term as well as selected lecture notes from a previous term. Reference textbooks for each topic are listed in the table below. Lecture notes also contain references.\nTOPICS READINGS Network flows Ahuja, R. K., T. L. Magnanti, and J. B. Orlin. Network Flows: Theory, Algorithms, and Applications. Upper Saddle River, NJ: Prentice Hall, 1993. ISBN: 9780136175490. Data structures For both splay trees and dynamic trees:\nSleator, and Tarjan. \u0026ldquo;Self-adjusting Binary Search Trees.\u0026rdquo; Journal of the ACM 32, no. 3 (July, 1985): 652-686. ISSN: 0004-5411.\nCormen, T.H., C.E. Leiserson, R.L. Rivest, and C. Stein. Introduction to Algorithms. 2nd ed. Cambridge, MA: MIT Press, 2001. ISBN: 9780262032933.\nLinear programming Schrijver, A. Theory of Linear and Integer Programming. New York, NY: John Wiley \u0026amp; Sons, 1998. ISBN: 9780471982326.\nFor the Ellipsoid, 3 references are:\nGroetschel, M., L. Lovasz, and A. Schrijver. Geometric Algorithms and Combinatorial Optimization. New York, NY: Springer-Verlag, 1993, chapter 3. ISBN: 9780387567402. [The standard reference on the ellipsoid. The most complete and precise description.]\nChvatal, V. Linear Programming. New York, NY: W.H. Freeman and Company, 1983, appendix. ISBN: 9780716715870. [An easy to read description without all the details.]\nKorte, B. H., and J. Vygen. Combinatorial Optimization. New York, NY: Springer-Verlag, 2002, chapter 4. ISBN: 9783540431541. [A detailed description.]\nFor Interior-point Algorithms, a good reference is:\nRoos, C., T. Terlaky, and J.-Ph. Vial. Theory and Algorithms for Linear Optimization: An Interior Point Approach. New York, NY: John Wiley \u0026amp; Sons, 1997. ISBN: 9780471956761.\nConvex programming Boyd, Stephen, and Lieven Vandenberghe. Convex Optimization . Cambridge, UK: Cambridge Univ. Press, 2005. ISBN: 9780521833783\nNemirovski, Arkadi. \u0026ldquo;Lectures on Modern Convex Optimization.\u0026rdquo; (PDF - 2.7 MB)\nApproximation algorithms Vazirani, V. Approximation Algorithms. New York, NY: Springer-Verlag, 2004. ISBN: 9783540653677.\nHochbaum, D., ed. Approximation Algorithms for NP-Hard Problems. Boston: PWS Publishing Company, 1996. ISBN: 9780534949686.\nArora, Sanjeev. \u0026ldquo;Polynomial Time Approximation Schemes for Euclidean Traveling Salesman and Other Geometric Problems.\u0026rdquo; Journal of the ACM 45, no. 5 (September, 1998). New York, NY, USA: ACM Press. ISSN: 0004-5411.\nGeometric algorithms\nde Berg, Mark, O. Cheong, M. van Kreveld, and M. Overmars. Computational Geometry. 3rd ed. New York, NY: Springer-Verlag, 2008. ISBN: 9783540779735\nStreaming algorithms S. Muthukrishnan, \u0026ldquo;Data streams: Algorithms and applications\u0026rdquo;, Foundations and Trends in Theoretical Computer Science, Volume 1, issue 2, 2005.\nNumber-theoretic algorithms Lov\u0026rsquo;asz, L. \u0026ldquo;An Algorithmic Theory of Numbers, Graphs, and Convexity.\u0026rdquo; In CBMS Regional Conference Series in Applied Mathematics (SIAM, 1986). Philadelphia, PA: Society for Industrial and Applied Mathematics, 1987. ISBN: 9780898712032.\nBach, E., and J. Shallit. Algorithmic Number Theory. Vol. 1. Cambridge, MA: MIT Press, August 26, 1996. ISBN: 9780262024051.\n"}


